Repository: jonasob/jwhois
Catalog: po/*.po
Languages: ka, zh_cn

source: Invalid expire time
ka: ვადის არასწორი ფორმატი
zh_cn: 无效的过期日

source: Unable to open
ka: გახსნის შეცდომა
zh_cn: 无法打开

source: Unable to store data in cache
ka: ქეშში მონაცემების შენახვის შეცდომა
zh_cn: 无法在缓存中保存数据

source: host not found
ka: ჰოსტი ნაპოვნი არაა
zh_cn: 未找到主机

source: Address family for hostname not supported
ka: ამ ჰოსტის მისამართის ტიპი მხარდაუჭერელია
zh_cn: 不支持主机的地址范围

source: Temporary failure in name resolution
ka: სახელის გადაწყვეტის დროებითი შეცდომა
zh_cn: 名字解析中有临时错误

source: Bad value for ai_flags
ka: არასწორი მნიშვნელობა: ai_flags
zh_cn: ai_flags 的值错误

source: Non-recoverable failure in name resolution
ka: სახელის გადაწყვეტის აღუდგენელი შეცდომა
zh_cn: 名字解析中有不可恢复的错误

source: ai_family not supported
ka: ai_family მხარდაუჭერელია
zh_cn: 不支持 ai_family

source: Memory allocation failure
ka: მეხსიერების გამოყოფის შეცდომა
zh_cn: 内存分配错误

source: No address associated with hostname
ka: ჰოსტის სახელზე მიბმული არაა
zh_cn: 主机没有关联的地址

source: Name or service not known
ka: სახელი ან სერვისი უცნობია
zh_cn: 未知的名称或服务

source: Servname not supported for ai_socktype
ka: Ai_socktype-ის სერვერის სახელი მხარდაუჭერელია
zh_cn: ai_socktype 不支持此服务

source: ai_socktype not supported
ka: ai_socket-ი მხარდაუჭერელია
zh_cn: 不支持 ai_socktype

source: System error
ka: სისტემური შეცდომა
zh_cn: 系统错误

source: Unknown error
ka: უცნობი შეცდომა
zh_cn: 未知错误

source: %s: option `%s' is ambiguous
ka: %s: პარამეტრი '%s' გაურკვეველია
zh_cn: %s: 选项‘%s’有歧义

source: %s: option `--%s' doesn't allow an argument
ka: %s: პარამეტრი '--%s' არგუმენტებს არ იღებს
zh_cn: %s: 选项‘--%s’不允许带参数

source: %s: option `%c%s' doesn't allow an argument
ka: %s: პარამეტრი '%c%s' არგუმენტებს არ იღებს
zh_cn: %s: 选项‘%c%s’不允许带参数

source: %s: option `%s' requires an argument
ka: %s: პარამეტრი '--%s' საჭიროებს არგუმენტს.
zh_cn: %s: 选项‘%s’需要一个参数

source: %s: unrecognized option `--%s'
ka: %s: უცნობი პარამეტრი '--%s'
zh_cn: %s: 不可识别的选项‘--%s’

source: %s: unrecognized option `%c%s'
ka: %s: უცნობი პარამეტრი '%c'%s'
zh_cn: %s: 不可识别的选项‘%c%s’

source: %s: illegal option -- %c
ka: %s: დაუშვებელი პარამეტრი -- %c
zh_cn: %s: 非法选项 -- %c

source: %s: invalid option -- %c
ka: %s: არასწორი პარამეტრი -- '%c'
zh_cn: %s: 无效选项 -- %c

source: %s: option requires an argument -- %c
ka: %s: პარამეტრს ესაჭიროება არგუმენტი -- '%c'
zh_cn: %s: 选项需要一个参数 -- %c

source: %s: option `-W %s' is ambiguous
ka: %s: პარამეტრი '-W %s' ბუნდოვანია
zh_cn: %s: 选项‘-W %s’有歧义

source: %s: option `-W %s' doesn't allow an argument
ka: %s: პარამეტრი '-W %s' არგუმენტს არ იღებს
zh_cn: %s: 选项‘-W %s’不允许带参数

source: HTTP configuration is incomplete:
ka: HTTP კონფიგურაცია არასრულია:
zh_cn: HTTP 未配置好:

source: Option is missing:
ka: აკლია პარამეტრი:
zh_cn: 缺少的选项:

source: Option http-method must be "GET" or "POST".
ka: პარამეტრი http-method უნდა იყოს "GET" ან "POST".
zh_cn: http-method 选项必须是“GET”或“POST”。

source: Unable to create temporary file
ka: დროებითი ფაილის შექმნის შეცდომა
zh_cn: 无法创建临时文件

source: Querying
ka: მოთხოვნა
zh_cn: 正在查寻

source: Unable to run web browser
ka: ბრაუზერის გაშვების შეცდომა
zh_cn: 无法运行网络浏览器

source: Copyright (C) 1999-%d Free Software Foundation, Inc.
zh_cn: 版权所有 (C) 1999-%d Free Software Foundation, Inc。

source: This program is free software with ABSOLUTELY NO WARRANTY; you may redistribute it under the terms of the GNU General Public License.
zh_cn: 此程序为自由软件，不带任何保证；您可以在 GNU 通用公共协议 的框架下重新分发它。

source: version
ka: ვერსია
zh_cn: 版本

source: Usage: jwhois [OPTIONS] [QUERY]
ka: გამოყენება: jwhois [პარამერები] [მოთხოვნა]
zh_cn: 用法: jwhois [选项] [查寻关键词]

source: --version display version number and patch level --help display this help -v, --verbose verbose debug output -c FILE, --config=FILE use FILE as configuration file -h HOST, --host=HOST explicitly query HOST -n, --no-redirect disable content redirection -s, --no-whoisservers disable whois-servers.net service support -a, --raw disable reformatting of the query -i, --display-redirections display all redirects instead of hiding them -p PORT, --port=PORT use port number PORT (in conjunction with HOST) -r, --rwhois force an rwhois query to be made --rwhois-display=DISPLAY sets the display option in rwhois queries --rwhois-limit=LIMIT sets the maximum number of matches to return
ka: --version ვერსიის ნომრისა და პატჩის დონის ჩვენება --help ამ დახმარების ჩვენება -v, --verbose დამატებითი შეტყობინებების გამოტანა -C ფაილი, --config=ფაილი მითითებული ფაილის, როგორც კონფიგურაციის ფაილის გამოყენება -h ჰოსტი, --host=ჰოსტი ჰოსტის სახელს მითითება -n, --no-redirect შემცველობის გადამისამართების გამორთვა -s, --no-whoisservers whois-servers.net სერვისის მხარდაჭერის გამორთვა -a, --raw მოთხოვნის თავიდან ფორმატირების გამორთვა -i, --display-redirections ყველა გადაისამართების ჩვენება, დამალვის მაგიერ -p PORT, --port=PORT პორტის მითითებული ნომრის გამოყენება (ჰოსტთან ერთად) -r, --rwhois rwhois მოთხოვნის გამოყენება --rwhois-display= whois მოთხოვნების ჩვენების ფორმატირება --rwhois-limit=LIMIT დაბრუნებული პასუხების მაქსიმალური რაოდენობა
zh_cn: --version 显示版本号和修订号 --help 显示此帮助 -v, --verbose 输出详细的调试信息 -c FILE, --config=FILE 使用 FILE 作为配置文件 -h HOST, --host=HOST 指定查寻 HOST -n, --no-redirect 禁用内容重定向 -s, --no-whoisservers 关闭 whois-servers.net 服务支持 -a, --raw 禁止重新格式化查寻条件 -i, --display-redirections 显示所有重定向，而不是隐藏它们 -p PORT, --port=PORT 使用端口号 PORT (与 HOST 结合使用) -r, --rwhois 强制生成一个 rwhois 请求 --rwhois-display=DISPLAY 设置 rwhois 请求中的显示选项 --rwhois-limit=LIMIT 设置用于返回的最多匹配数值

source: -f, --force-lookup force lookup even if the entry is cached -d, --disable-cache disable cache functions
ka: -f, --force-lookup მოთხოვნის გაგზავნა ობიექტის ქეშში არსებობის შემთხვევაშიც კი -d, --disable-cache ქეშის ფუნქციების გამორთვა
zh_cn: -f, --force-lookup 即使表单被缓存了也要强制查寻 -d, --disable-cache 禁用缓存功能

source: Report bugs to bug-jwhois@gnu.org
ka: შეცდომების ანგარიშები გააგზავნეთ ელფოსტაზე bug-jwhois@gnu.org
zh_cn: 发送错误报告至 bug-jwhois@gnu.org

source: Invalid limit
ka: არასწორი ლიმიტი
zh_cn: 无效的限制

source: Invalid port number
ka: პორტის არასწორი ნომერი
zh_cn: 无效的端口号

source: Error allocating memory
ka: მეხსიერების გამოყოფის შეცდომა
zh_cn: 分配内存错误

source: String out of bounds on line
ka: სტრიქონი საზღვრებს გარეთაა. ხაზი
zh_cn: 线上有带外数据

source: End of file looking for '"' on line
ka: ფაილი დასრულდა '"'-ის ძებნისას ხაზზე
zh_cn: 线上有文件结尾符(查寻")

source: Unexpected end of file on line
ka: ფაილი მოულოდნელად დასრულდა ხაზზე
zh_cn: 线上有不正常的文件结尾符

source: Multiple keys on line
ka: ბევრი გასაღები ხაზზე
zh_cn: 线上有多个密钥

source: Missing key on line
ka: აკლია გასაღები ხაზზე
zh_cn: 线上缺少密钥

source: Fatal error searching for host to query
ka: ფატალური შეცდომა მოთხოვნის გასაგზავნი ჰოსტის ძებნისას
zh_cn: 搜索主机查寻时发生严重错误

source: Error reading cache
ka: ქეშის წაკითხვის შეცდომა
zh_cn: 读取缓存时错误

source: Cached
ka: დაქეშილი
zh_cn: 已缓存

source: Error writing to cache
ka: ქეშში ჩაწერის შეცდომა
zh_cn: 写入缓存时错误

source: Invalid netmask on line
ka: ქსელის არასწორი ნიღაბი ხაზზე
zh_cn: 线上有无效网络掩码

source: [%s: Missing prefix length on line %d]
ka: [%s: აკლია პრეფიქსის სიგრძე ხაზზე %d]
zh_cn: [%s: 线上缺少网络掩码 %d]

source: [%s: Invalid prefix length on line %d]
ka: [%s: პრეფიქსის არასწორი სიგრძე ხაზზე %d]
zh_cn: [%s: 线上有无效的网络掩码 %d]

source: [%s: Invalid network address on line %d]
ka: [%s: არასწორი ქსელის მისამართი ხაზზე %d]
zh_cn: [%s: 线上有无效的网络地址 %d]

source: Warning: Configuration file contains references to IPv6,
ka: გაფრთხილება: კონფიგურაციის ფაილი შეიცავს IPv6-ს,
zh_cn: 警告: 配置文件包含有关 IPv6 的内容，

source: but jwhois was compiled without IPv6 support.
ka: მაგრამ jwhois-ი IPv6-ის მხარდაჭერის გარეშეა აგებული.
zh_cn: 但是 jwhois 编译为不带 IPv6 支持。

source: Redirected to
ka: გადამისამართებულია
zh_cn: 重定向至

source: [Unable to connect to remote host]
ka: [დაშორებულ ჰოსტთან დაკავშირების შეცდომა]
zh_cn: [无法连接至远程主机]

source: [RWHOIS: Protocol error while sending -rwhois option]
ka: [RWHOIS: პროტოკოლის შეცდომა -rwhois პარამეტრის გაგზავნისას]
zh_cn: [RWHOIS: 发送 -rwhois 选项时协议错误]

source: Server does not support display command
ka: სერვერს display ბრძანების მხარდაჭერა არ გააჩნია
zh_cn: 服务器不支持 display 命令

source: Invalid limit in configuration file
ka: არასწორი ლიმიტი კონფიგურაციის ფალში
zh_cn: 配置文件中的限制无效

source: Server does not support limit
ka: სერვერს ლიმიტის მხარდაწერაარ გააჩნია
zh_cn: 服务器不支持 limit

source: Unknown referral
ka: უცნობი რეფერალი
zh_cn: 未知的索引

source: Following referral to
ka: რეფერალზე მიყოლა ობიექტამდე
zh_cn: 跟踪索引至

source: [Host terminated connection prematurely]
ka: [ჰოსტმა შეერთება ნაადრევად დახურა]
zh_cn: [过早地中断了主机连接]

source: Unhandled reply
ka: დაუმუშავებელი პასუხი
zh_cn: 未处理的响应

source: Error creating socket
ka: სოკეტის შექმნის შეცდომა
zh_cn: 创建套接字时错误

source: Invalid connect timeout value
ka: დაკავშირების მოლოდინის არასწორი მნიშვნელობა
zh_cn: 无效的连接超时值

source: Error reading data from
ka: მონაცემების კითხვის შეცდომა წყაროდან
zh_cn: 从 ... 读取数据时错误
